# GetPath Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Railing..::..GetPath Method
Railing Class See Also
---
Gets the railing path.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<Curve> GetPath()
```

Visual Basic
---
```text
Public Function GetPath As IList(Of Curve)
```

Visual C++
---
```text
public:
IList<Curve^>^ GetPath()
```

# ### Return Value
The curve array of the railing path.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | The railing has incorrect internal data. |

# See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace